

const eightCore = [
  {
    name: '齐齐哈尔医学院',
    coord: [123.957548, 47.384783],
  },
  {
    name: '新疆医科大学第二附属医院',
    coord: [87.622842,43.83671],
  },
  {
    name: '新疆维吾尔自治区人民医院',
    coord: [87.62037,43.790165],
  },
  {
    name: '广西壮族自治区脑科医院',
    coord: [109.444801,24.284652],
  },
  {
    name: '重庆医科大学第一附属医院',
    coord: [106.519417,29.53665],
  },
  {
    name: '福州神经精神病防治院',
    coord: [119.295665,26.032617],
  },
  {
    name: '深圳市康宁医院',
    coord: [114.136634,22.56941],
  },
  {
    name: '广州惠爱医院',
    coord: [113.246833,23.104468],
  },



]

export default eightCore