const TFdata = [
  {
    name: '哈尔滨医科大学附属一医院',
    coord: [126.655342, 45.772786]
  },
  {
    name: '辽宁省精神卫生中心',
    coord: [123.499365, 41.748014]
  },
  {
    name: '河北医科大学第一医院',
    coord: [114.559384, 38.022797]
  },
  {
    name: '山西医科大学第一医院',
    coord: [112.561764, 37.859698]
  },
  {
    name: '中国人民解放军第904医院(原102)',
    coord: [119.973954, 31.785667]
  },
  {
    name: '南京脑科医院',
    coord: [118.775271, 32.056233]
  },
  {
    name: '浙江大学医学院附属第一医院',
    coord: [120.184528, 30.262953]
  },
  {
    name: '合肥市第四人民医院',
    coord: [117.270057, 31.849985]
  },
  {
    name: '河南省精神病医院',
    coord: [113.64588, 34.759971]
  },
  {
    name: '湖南省脑科医院',
    coord: [112.992205, 28.160968]
  },
  {
    name: '广东省精神卫生中心',
    coord: [113.264141, 23.126671]
  },
  {
    name: '江西省精神卫生中心',
    coord: [115.939409, 28.683856]
  },
  {
    name: '贵州医科大学附属医院',
    coord: [106.719577, 26.60061]
  },
  {
    name: '海南省安宁医阮',
    coord: [110.343703, 20.000305]
  },
  {
    name: '昆明医科大学第一附属医院',
    coord: [102.699404, 25.048749]
  },
  {
    name: '四川大学华西医院',
    coord: [104.067527, 30.64722]
  },
  {
    name: '新疆医科大学第一附属医院',
    coord: [87.589041, 43.845296]
  },
  {
    name: '兰州大学第二医院',
    coord: [103.818942, 36.06745]
  },
  {
    name: '第四军医大学第一附属医院',
    coord: [108.99469, 34.279883]
  },
  {
    name: '武汉大学人民医院',
    coord: [114.305953, 30.540879]
  },
  // {
  //   name: '',
  //   coord: []
  // },
  // {
  //   name: '',
  //   coord: []
  // },
  // {
  //   name: '',
  //   coord: []
  // },
  // {
  //   name: '',
  //   coord: []
  // },




]

export default TFdata